//;******************************************************************************
//;* Copyright (c) 2015 - 2020, Insyde Software Corp. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************
//; 

/=#

#include "Standard.uni"

#string STR_FORM_SET_TITLE                  #language en-US       "VFR Application"
                                            #language fr-FR       "VFR Application"
                                            #language zh-TW       "VFR Application \wide選單\narrow"
                                            #language ja-JP       "VFR Application \wideメイン\narrow"
                                            #language it-IT       "VFR Application"
                                            #language es-ES       "VFR Application"
                                            #language de-DE       "VFR Application"
                                            #language pt-PT       "VFR Application"
#string STR_FORM_SET_TITLE_HELP             #language en-US       "VFR Application Help Message"
#string STR_EMPTY_TEXT                      #language en-US       " "
#string STR_TEST_H2O_DIALOG_PROMPT          #language en-US       "Test H2O Dialog before SendForm"
#string STR_TEST_H2O_DIALOG_HELP            #language en-US       "Test all functions of H2O Dialog protocol before calling SendForm function"
#string STR_TEST_HII_POP_UP_DIALOG_PROMPT   #language en-US       "Test HII Popup Dialog before SendForm"
#string STR_TEST_HII_POP_UP_DIALOG_HELP     #language en-US       "Test all functions of HII Popup Dialog protocol before calling SendForm function"
#string STR_DISPLAY_ENGINE_CONTROL_PROMPT   #language en-US       "Active Display Engine"
#string STR_DISPLAY_ENGINE_CONTROL_HELP     #language en-US       "Determine which display engine is active.\n\nNOTE: Switching process will run after ready to boot event."
#string STR_ACTIVE_DISPLAY_ENGINE_ALL       #language en-US       "All Display Engines"
#string STR_ACTIVE_DISPLAY_ENGINE_METRO     #language en-US       "Metro Display Engine"
#string STR_ACTIVE_DISPLAY_ENGINE_TEXT      #language en-US       "Text Display Engine"
#string STR_MISC_SETTING_TEXT               #language en-US       "Misc Settings"

#string STR_SUBTITLE_TEXT_QUESTION_DIALOG          #language en-US       "Question Dialog Test"
// Form - Numeric Opcode 
#string STR_FORM_NUMERIC_OPCODE_TITLE              #language en-US        "Numeric Opcode"
#string STR_FORM_NUMERIC_OPCODE_HELP               #language en-US        "Test the dialog of Numeric Opcode"
#string STR_QUESTION_NUMERIC_OPCODE_ONE_PROMPT     #language en-US        "Numeric 001 - normal case"
#string STR_QUESTION_NUMERIC_OPCODE_ONE_HELP       #language en-US        "Numeric 001 - Normal case"
#string STR_QUESTION_NUMERIC_OPCODE_TWO_PROMPT     #language en-US        "Numeric 002 - test range"
#string STR_QUESTION_NUMERIC_OPCODE_TWO_HELP       #language en-US        "Numeric 002 - Test the range from 0x0 to 0xFFFFFFFFFFFFFFFF"
#string STR_QUESTION_NUMERIC_OPCODE_THREE_PROMPT   #language en-US        "Numeric 003 - test Hex display"
#string STR_QUESTION_NUMERIC_OPCODE_THREE_HELP     #language en-US        "Numeric 003 - Test Hex display of numeric value"
#string STR_QUESTION_NUMERIC_OPCODE_FOUR_PROMPT    #language en-US        "Numeric 004 - test READ_ONLY flag"
#string STR_QUESTION_NUMERIC_OPCODE_FOUR_HELP      #language en-US        "Numeric 004 - Test the display of READ_ONLY flag"
#string STR_QUESTION_NUMERIC_OPCODE_FIVE_PROMPT    #language en-US        "Numeric 005 - test signed INT8 value"
#string STR_QUESTION_NUMERIC_OPCODE_FIVE_HELP      #language en-US        "Numeric 005 - Min = -128, Max = 127"
#string STR_QUESTION_NUMERIC_OPCODE_SIX_PROMPT     #language en-US        "Numeric 006 - test signed INT16 value"
#string STR_QUESTION_NUMERIC_OPCODE_SIX_HELP       #language en-US        "Numeric 006 - Min = -32768, Max = 32767"
#string STR_QUESTION_NUMERIC_OPCODE_SEVEN_PROMPT   #language en-US        "Numeric 007 - test signed INT32 value"
#string STR_QUESTION_NUMERIC_OPCODE_SEVEN_HELP     #language en-US        "Numeric 007 - Min = -2147483648, Max = 2147483647"
#string STR_QUESTION_NUMERIC_OPCODE_EIGHT_PROMPT   #language en-US        "Numeric 008 - test signed INT64 value"
#string STR_QUESTION_NUMERIC_OPCODE_EIGHT_HELP     #language en-US        "Numeric 008 - Min = -9223372036854775808, Max = 9223372036854775807"
// Form - RefreshId 
#string STR_TEXT_REFRESH_GUID_COUNT                #language en-US        "Refresh guid event count"
#string STR_NUMERIC_HELP0                          #language en-US        "This is the help for those who are too old to understand the question. Type how old you are in a numeric value.  The valid range in this case is from 0 to 240.  Let's see if you actually read this help and figure that out."
#string STR_EXIT_TEXT                              #language en-US        "Exit now!"
#string STR_APP_TEXT_REFRESH_GUID                  #language en-US        "Add new menu by press "Ctrl + C""

// Form - OneOf Opcode 
#string STR_FORM_ONE_OF_OPCODE_TITLE                 #language en-US        "OneOf Opcode"
#string STR_FORM_ONE_OF_OPCODE_HELP                  #language en-US        "Test the dialog of OneOf Opcode"
#string STR_QUESTION_ONE_OF_OPCODE_ONE_PROMPT        #language en-US        "OneOf 001 - normal case"
#string STR_QUESTION_ONE_OF_OPCODE_ONE_HELP          #language en-US        "OneOf 001 - Normal case"
#string STR_QUESTION_ONE_OF_OPCODE_TWO_PROMPT        #language en-US        "OneOf 002 - Option occupied multi lines"
#string STR_QUESTION_ONE_OF_OPCODE_TWO_HELP          #language en-US        "OneOf 002 - Test option value which occupied multi lines"
#string STR_QUESTION_ONE_OF_OPCODE_TWO_VALUE_ZERO    #language en-US        "Value 0 Value 0 Value 0 Value 0 Value 0 Value 0 Value 0 Value 0 Value 0 Value 0 Value 0 Value 0 Value 0 Value 0 Value 0 Value 0 Value 0 Value 0 Value 0 Value 0 Value 0 Value 0 Value 0 Value 0 Value 0 Value 0 Value 0 Value 0 Value 0 Value 0"
#string STR_QUESTION_ONE_OF_OPCODE_THREE_PROMPT      #language en-US        "OneOf 003 - Option string with line feed character"
#string STR_QUESTION_ONE_OF_OPCODE_THREE_HELP        #language en-US        "OneOf 003 - Test option string with line feed character. Total line number is 3."
#string STR_QUESTION_ONE_OF_OPCODE_THREE_VALUE_ZERO  #language en-US        "Line 1 \nLine 2 \nLine 3 "
#string STR_QUESTION_ONE_OF_OPCODE_FOUR_PROMPT       #language en-US        "OneOf 004 - Option list is two pages"
#string STR_QUESTION_ONE_OF_OPCODE_FOUR_HELP         #language en-US        "OneOf 004 - Test option list which need multi pages"
#string STR_QUESTION_ONE_OF_OPCODE_FOUR_VALUE_ZERO   #language en-US        "Value 0"
#string STR_QUESTION_ONE_OF_OPCODE_FOUR_VALUE_ONE    #language en-US        "Value 1"
#string STR_QUESTION_ONE_OF_OPCODE_FOUR_VALUE_TWO    #language en-US        "Value 2"

// Form - String Opcode 
#string STR_FORM_STRING_OPCODE_TITLE                 #language en-US        "String Opcode"
#string STR_FORM_STRING_OPCODE_HELP                  #language en-US        "Test the dialog of String Opcode"
#string STR_QUESTION_STRING_OPCODE_ONE_PROMPT        #language en-US        "String 001 - normal case"
#string STR_QUESTION_STRING_OPCODE_ONE_HELP          #language en-US        "String 001 - Normal case"
#string STR_QUESTION_STRING_OPCODE_TWO_PROMPT        #language en-US        "String 002 - Multi line string input"
#string STR_QUESTION_STRING_OPCODE_TWO_HELP          #language en-US        "String 002 - User can input string which occupy multi line"
#string STR_QUESTION_STRING_OPCODE_THREE_PROMPT      #language en-US        "String 003 - Min size check"
#string STR_QUESTION_STRING_OPCODE_THREE_HELP        #language en-US        "String 003 - Check valid string size is 6~10."

// Form - Password Opcode 
#string STR_FORM_PASSWORD_OPCODE_TITLE               #language en-US        "Password Opcode"
#string STR_FORM_PASSWORD_OPCODE_HELP                #language en-US        "Test the dialog of Password Opcode"
#string STR_QUESTION_PASSWORD_OPCODE_ONE_PROMPT      #language en-US        "Password 001 - normal case"
#string STR_QUESTION_PASSWORD_OPCODE_ONE_HELP        #language en-US        "Password 001 - Normal case"

// Form - Ordered List Opcode 
#string STR_FORM_ORDERED_LIST_OPCODE_TITLE           #language en-US        "Ordered List Opcode"
#string STR_FORM_ORDERED_LIST_OPCODE_HELP            #language en-US        "Test the dialog of Ordered List Opcode"
#string STR_TEST_ORDERED_LIST_OPTION_ONE             #language en-US        "Ordered List Option 1"
#string STR_TEST_ORDERED_LIST_OPTION_TWO             #language en-US        "Ordered List Option 2"
#string STR_TEST_ORDERED_LIST_OPTION_THREE           #language en-US        "Ordered List Option 3"
#string STR_TEST_ORDERED_LIST_OPTION_FOUR            #language en-US        "Ordered List Option 4"
#string STR_TEST_ORDERED_LIST_OPTION_FIVE            #language en-US        "Ordered List Option 5"
#string STR_TEST_ORDERED_LIST_OPTION_SIX             #language en-US        "Ordered List Option 6"
#string STR_TEST_ORDERED_LIST_OPTION_SEVEN           #language en-US        "Ordered List Option 7"
#string STR_TEST_ORDERED_LIST_OPTION_EIGHT           #language en-US        "Ordered List Option 8"
#string STR_TEST_ORDERED_LIST_OPTION_NINE            #language en-US        "Ordered List Option 9"
#string STR_TEST_ORDERED_LIST_OPTION_TEN             #language en-US        "Ordered List Option 10"

// Form - Time Opcode 
#string STR_FORM_TIME_OPCODE_TITLE                   #language en-US        "Time Opcode"
#string STR_FORM_TIME_OPCODE_HELP                    #language en-US        "Test the dialog of Time Opcode"

// Form - Date Opcode 
#string STR_FORM_DATE_OPCODE_TITLE                   #language en-US        "Date Opcode"
#string STR_FORM_DATE_OPCODE_HELP                    #language en-US        "Test the dialog of Date Opcode"

// Form - Checkbox Opcode 
#string STR_FORM_CHECKBOX_OPCODE_TITLE               #language en-US        "Checkbox Opcode"
#string STR_FORM_CHECKBOX_OPCODE_HELP                #language en-US        "Test the Checkbox Opcode"

// Form - Goto Opcode 
#string STR_FORM_GOTO_OPCODE_TITLE                   #language en-US        "Goto Opcode"
#string STR_FORM_GOTO_OPCODE_HELP                    #language en-US        "Test the Goto Opcode"
#string STR_QUESTION_GOTO_OPCODE_ONE_PROMPT          #language en-US        "Go to Second Question"
#string STR_QUESTION_GOTO_OPCODE_ONE_HELP            #language en-US        "Go to Second Question"
#string STR_QUESTION_GOTO_OPCODE_TWO_PROMPT          #language en-US        "Go to Root Form"
#string STR_QUESTION_GOTO_OPCODE_TWO_HELP            #language en-US        "Go to Root Form"

// Form - Ordered List Default Array Opcode 
#string STR_FORM_ORDERED_LIST_DEFAULT_OPCODE_TITLE   #language en-US        "Ordered List Default Array Opcode"
#string STR_FORM_ORDERED_LIST_DEFAULT_OPCODE_HELP    #language en-US        "Test array default of Ordered List Opcode"
#string STR_TEST_ORDERED_LIST_NUMBER_ONE             #language en-US        "Ordered List No 1"
#string STR_TEST_ORDERED_LIST_NUMBER_TWO             #language en-US        "Ordered List No 2"
#string STR_TEST_ORDERED_LIST_NUMBER_THREE           #language en-US        "Ordered List No 3"
#string STR_TEST_ORDERED_LIST_NUMBER_FOUR            #language en-US        "Ordered List No 4"
#string STR_EMPTY_STRING                             #language en-US        ""
#string STR_TEST_ORDERED_DEFAULT_LIST               #language en-US        "Ordered List Array Default"

// Form - Refresh Opcode 
#string STR_FORM_REFRESH_OPCODE_TITLE                #language en-US        "Refresh Opcode"
#string STR_FORM_REFRESH_OPCODE_HELP                 #language en-US        "Test the Refresh Opcode"

// Form - Subtitle Opcode 
#string STR_FORM_SUBTITLE_OPCODE_TITLE               #language en-US        "Subtitle Opcode"
#string STR_FORM_SUBTITLE_OPCODE_HELP                #language en-US        "Test the Subtitle Opcode"
#string STR_QUESTION_SUBTITLE_OPCODE_ONE_PROMPT      #language en-US        "One Line"
#string STR_QUESTION_SUBTITLE_OPCODE_TWO_PROMPT      #language en-US        "Multiple Lines Multiple Lines Multiple Lines Multiple Lines Multiple Lines Multiple Lines Multiple Lines "

#string STR_SUBTITLE_TEXT_PANEL                      #language en-US        "Panel Display Test"
// Form - Setup Page Panel
#string STR_FORM_SETUP_PAGE_PANEL_TITLE              #language en-US        "Setup Page Panel"
#string STR_FORM_SETUP_PAGE_PANEL_HELP               #language en-US        "Test Setup Page Panel"

// Form - Help Panel
#string STR_FORM_HELP_PANEL_TITLE                    #language en-US        "Help Text Panel"
#string STR_FORM_HELP_PANEL_HELP                     #language en-US        "Test Help Text Panel"

// Common strings
#string STR_SUBTITLE_TEXT                   #language en-US       "Subtitle"
#string STR_DISABLED_TEXT                   #language en-US       "Disabled"
                                            #language fr-FR       "Désactiver"
                                            #language zh-TW       "\wide停用\narrow"
                                            #language ja-JP       "\wide使用しない\narrow"
#string STR_ENABLED_TEXT                    #language en-US       "Enabled"
                                            #language fr-FR       "Activer"
                                            #language zh-TW       "\wide啟用\narrow"
                                            #language ja-JP       "\wide使用する\narrow"
#string STR_TIME_PROMPT                     #language en-US        "System Time"
                                            #language fr-FR        "Temps Système"
                                            #language zh-TW       "\wide系統時間\narrow"
                                            #language ja-JP       "\wideシステム時刻\narrow"
#string STR_TIME_HOUR_HELP                  #language en-US        "This is the help for the hour field. Valid range is from 0 to 23. INCREASE/REDUCE : +/-."
                                            #language fr-FR        "C'est utile pour regler l'heure. Champsvalide est de 0 à 23. AUGEMENTER/REDUIRE : +/-."
                                            #language zh-TW       "\wide時\narrow \wide的有效值範圍從\narrow 0 \wide至\narrow 23"
                                            #language ja-JP       "\wide現在の時刻を、時\narrow:\wide分\narrow:\wide秒で設定します。\narrow(\wide時\narrow:0~23)                          <Pg Up>\wideまたは\narrow<sp-spaCE>\wideキーで設定します。\narrow                                <Pg Dn> \wideキーで設定\narrow      \wideします。\narrow                                       <Tab> \wideキーで右の項目に移動します。\narrow"
#string STR_TIME_MINUTE_HELP                #language en-US        "This is the help for the minute field. Valid range is from 0 to 59. INCREASE/REDUCE : +/-."
                                            #language fr-FR        "C'est utile pour regler l'minute. Champsvalide est de 0 à 59. AUGEMENTER/REDUIRE : +/-."
                                            #language zh-TW       "\wide分\narrow \wide的有效值範圍從\narrow 0 \wide至\narrow 59"
                                            #language ja-JP       "\wide現在の時刻を、時\narrow:\wide分\narrow:\wide秒で設定します。\narrow(\wide分\narrow:0~59)                           <Pg Up>\wideまたは\narrow<sp-spaCE>\wideキーで設定します。\narrow                                <Pg Dn> \wideキーで設定\narrow      \wideします。\narrow                                       <Tab> \wideキーで右の項目に移動します。\narrow"
#string STR_TIME_SECOND_HELP                #language en-US        "This is the help for the second field. Valid range is from 0 to 59. INCREASE/REDUCE : +/-."
                                            #language fr-FR        "C'est utile pour regler l'Seconde. Champsvalide est de 0 à 59. AUGEMENTER/REDUIRE : +/-."
                                            #language zh-TW       "\wide秒\narrow \wide的有效值範圍從\narrow 0 \wide至\narrow 59"
                                            #language ja-JP       "\wide現在の時刻を、時\narrow:\wide分\narrow:\wide秒で設定します。\narrow(\wide秒\narrow:0~59)                          <Pg Up>\wideまたは\narrow<sp-spaCE>\wideキーで設定します。\narrow                                <Pg Dn> \wideキーで設定\narrow      \wideします。\narrow                                       <Tab> \wideキーで右の項目に移動します。\narrow"
#string STR_DATE_PROMPT                     #language en-US        "System Date"
                                            #language fr-FR        "Date Système"
                                            #language zh-TW       "\wide系統日期\narrow"
                                            #language ja-JP       "\wideシステム日付\narrow"
#string STR_TIME_HELP                       #language en-US        "This is the help for the hour, minute, second field. Valid range is from 0 to 23, 0 to 59, 0 to 59. INCREASE/REDUCE : +/-."
                                            #language fr-FR        "C'est utile pour regler l'heure, l'minute, l'Seconde. Champsvalide est de 0 à 23, 0 à 59, 0 à 59. AUGEMENTER/REDUIRE : +/-."
                                            #language zh-TW       "\wide時\narrow \wide的有效值範圍從\narrow 0 \wide至\narrow 23.\wide分\narrow \wide的有效值範圍從\narrow 0 \wide至\narrow 59.\wide秒\narrow \wide的有效值範圍從\narrow 0 \wide至\narrow 59."
                                            #language ja-JP       "\wide現在の時刻を、時\narrow:\wide分\narrow:\wide秒で設定します。\narrow(\wide時\narrow:0~23) \narrow(\wide分\narrow:0~59) \narrow(\wide秒\narrow:0~59)      <Pg Up>\wideまたは\narrow<SPACE>\wideキーで設定します。\narrow                                <Pg Dn> \wideキーで設定\narrow      \wideします。\narrow                                       <Tab> \wideキーで右の項目に移動します。\narrow"
#string STR_DATE_PROMPT                     #language en-US        "System Date"
                                            #language fr-FR        "Date Système"
                                            #language zh-TW       "\wide系統日期\narrow"
                                            #language ja-JP       "\wideシステム日付\narrow"
#string STR_DATE_HELP                       #language en-US        "This is the help for the month field, day field, year field. Valid range is from 1 to 12, 1 to 31, 2000 to 2099. (Error checking will be done against month/day/year combinations that are not supported.) INCREASE/REDUCE : +/-."
                                            #language fr-FR        "C'est utile pour regler l'mois, l'jour, l'an. Champsvalide est de 1 à 12, 1 à 31, 2000 à 2099. (Verification incorrecte sera contre les combinaison de mois/jour/an qui sont pas supportées.) AUGEMENTER/REDUIRE : +/-."
                                            #language zh-TW       "\wide月\narrow \wide的有效值範圍從\narrow 1 \wide至\narrow 12. \wide日\narrow \wide的有效值範圍從\narrow 1 \wide至\narrow 31. \wide年\narrow \wide的有效值範圍從\narrow 2000 \wide至\narrow 2099. (\wide若輸入不符\narrow month/day/year\wide組合\narrow, \wide將會自動偵錯\narrow.)"
                                            #language ja-JP       "\wide現在の日付を、\wide月\narrow/\wide日\narrow/\wide年で設定します。\narrow(\wide月\narrow:1~12) \narrow(\wide日\narrow:1~31) (\wide年\narrow:2000~2099)                         <Pg Up>\wideまたは\narrow<SPACE>\wideキーで設定します。\narrow                                  <Pg Dn> \wideキーで設定\narrow      \wideします。\narrow                                       <Tab> \wideキーで右の項目に移動します。\narrow"
#string STR_DATE_MONTH_HELP                 #language en-US        "This is the help for the month field. Valid range is from 1 to 12. (Error checking will be done against month/day/year combinations that are not suppo-ported.) INCREASE/REDUCE : +/-."
                                            #language fr-FR        "C'est utile pour regler l'mois. Champsvalide est de 1 à 12. (Verification incorrecte sera contre les combinaison de mois/jour/an qui sont pas suppo-portées.) AUGEMENTER/REDUIRE : +/-."
                                            #language zh-TW       "\wide月\narrow \wide的有效值範圍從\narrow 1 \wide至\narrow 12 \wide。\narrow (\wide若輸入不符\narrow month/day/year\wide組合，將會自動偵錯\narrow)"
                                            #language ja-JP       "\wide現在の日付を、\wide月\narrow/\wide日\narrow/\wide年で設定します。\narrow(\wide月\narrow:1~12)                          <Pg Up>\wideまたは\narrow<sp-spaCE>\wideキーで設定します。\narrow                                  <Pg Dn> \wideキーで設定\narrow      \wideします。\narrow                                       <Tab> \wideキーで右の項目に移動します。\narrow"

#string STR_FB_FUNC_TEST                             #language en-US       "Form Browser Functionality Test"
#string STR_FB_FUNC_VFR_REFRESH_INTERVAL             #language en-US       "VFR OpCode: refresh interval"
#string STR_FB_FUNC_VFR_REFRESH_INTERVAL_HELP        #language en-US       "Test the functionality of VFR OpCode refresh interval"
#string STR_FB_FUNC_VFR_REFRESH_INTERVAL_S_ONE       #language en-US       "Statement 1"
#string STR_FB_FUNC_VFR_REFRESH_INTERVAL_S_TWO       #language en-US       "Statement 2"
#string STR_FB_FUNC_VFR_REFRESH_INTERVAL_Q_ONE       #language en-US       "Question 1"
#string STR_FB_FUNC_VFR_REFRESH_INTERVAL_Q_ONE_HELP  #language en-US       "Question 1 with refresh interval"
#string STR_FB_FUNC_VFR_REFRESH_INTERVAL_Q_TWO       #language en-US       "Question 2"
#string STR_FB_FUNC_VFR_REFRESH_INTERVAL_Q_TWO_HELP  #language en-US       "Question 2 with refresh interval"

// Form 1
#string STR_FORM1_TITLE                     #language en-US        "Form 1"


#string STR_TEST_ONE_LINE                   #language en-US        "One Line "

#string STR_TEST_ONE_OF_TWO_LINE            #language en-US        "Two Line Two Line Two Line Two Line Two Line Two Line Two Line Two Line Two Line Two Line Two Line Two Line Two Line Two Line Line Two Line Two Line Two Line Two Line Two Line Two Line Two Line "

#string STR_TEST_ORDERED_LIST               #language en-US        "Ordered List"


#string STR_HELP_ONE_PAGE                   #language en-US        "Help Message"
#string STR_UNKNOWN_DEV                     #language en-US        "Unknown"
#string STR_CON_OUT_DEV_LIST                #language en-US        "Console Output Device List"

// HiiPopup dialog
#string STR_HII_POP_UP_MESSAGE_INFO         #language en-US        "HiiPopup info message"
#string STR_HII_POP_UP_MESSAGE_WARNING      #language en-US        "HiiPopup warning message"
#string STR_HII_POP_UP_MESSAGE_ERROR        #language en-US        "HiiPopup error message"